tests/suite-1000-millis-sleep-test/75000-conc-2500/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /sleep/1000
Document Length:        27 bytes

Concurrency Level:      2500
Time taken for tests:   1327.855 seconds
Complete requests:      75000
Failed requests:        55663
   (Connect: 0, Receive: 0, Length: 55663, Exceptions: 0)
Non-2xx responses:      55663
Keep-Alive requests:    75000
Total transferred:      24088535 bytes
HTML transferred:       4251520 bytes
Requests per second:    56.48 [#/sec] (mean)
Time per request:       44261.850 [ms] (mean)
Time per request:       17.705 [ms] (mean, across all concurrent requests)
Transfer rate:          17.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   8.4      0      64
Processing:  1950 42325 17350.0  42036  166516
Waiting:     1950 42325 17350.1  42036  166516
Total:       1984 42327 17348.6  42036  166516

Percentage of the requests served within a certain time (ms)
  50%  42036
  66%  47716
  75%  52233
  80%  54751
  90%  62750
  95%  67431
  98%  82235
  99%  91998
 100%  166516 (longest request)